In [262]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt 
import seaborn as sns

In [263]:
df = pd.read_csv('Algerian_forest_fires_dataset_UPDATE.csv',header = 1)

In [264]:
df[df.isnull().any(axis=1)]

,day,month,year,Temperature,RH,Ws,Rain,FFMC,DMC,DC,ISI,BUI,FWI,Classes
122,Sidi-Bel Abbes Region Dataset,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
167,14,07,2012,37,37,18,0.2,88.9,12.9,14.6 9,12.5,10.4,fire,NaN

In [265]:
df.loc[:122,'Region'] = 0
df.loc[123:,'Region'] = 1

In [266]:
df[df.isnull().any(axis=1)]

,day,month,year,Temperature,RH,Ws,Rain,FFMC,DMC,DC,ISI,BUI,FWI,Classes,Region
122,Sidi-Bel Abbes Region Dataset,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0
167,14,07,2012,37,37,18,0.2,88.9,12.9,14.6 9,12.5,10.4,fire,NaN,1.0

In [267]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 246 entries, 0 to 245
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          246 non-null    object
 1   month        245 non-null    object
 2   year         245 non-null    object
 3   Temperature  245 non-null    object
 4    RH          245 non-null    object
 5    Ws          245 non-null    object
 6   Rain         245 non-null    object
 7   FFMC         245 non-null    object
 8   DMC          245 non-null    object
 9   DC           245 non-null    object
 10  ISI          245 non-null    object
 11  BUI          245 non-null    object
 12  FWI          245 non-null    object
 13  Classes      244 non-null    object
 14  Region       246 non-null    float64
dtypes: float64(1), object(14)
memory usage: 29.0+ KB

In [268]:
df['Region'] = df['Region'].astype('int64')

In [269]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 246 entries, 0 to 245
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          246 non-null    object
 1   month        245 non-null    object
 2   year         245 non-null    object
 3   Temperature  245 non-null    object
 4    RH          245 non-null    object
 5    Ws          245 non-null    object
 6   Rain         245 non-null    object
 7   FFMC         245 non-null    object
 8   DMC          245 non-null    object
 9   DC           245 non-null    object
 10  ISI          245 non-null    object
 11  BUI          245 non-null    object
 12  FWI          245 non-null    object
 13  Classes      244 non-null    object
 14  Region       246 non-null    int64
dtypes: int64(1), object(14)
memory usage: 29.0+ KB

In [270]:
df[df.isnull().any(axis=1)]

,day,month,year,Temperature,RH,Ws,Rain,FFMC,DMC,DC,ISI,BUI,FWI,Classes,Region
122,Sidi-Bel Abbes Region Dataset,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0
167,14,07,2012,37,37,18,0.2,88.9,12.9,14.6 9,12.5,10.4,fire,NaN,1

In [271]:
df.drop(122,inplace=True)

In [272]:
df.reset_index(drop=True, inplace=True)

In [273]:
df[df.isnull().any(axis=1)]

,day,month,year,Temperature,RH,Ws,Rain,FFMC,DMC,DC,ISI,BUI,FWI,Classes,Region
166,14,07,2012,37,37,18,0.2,88.9,12.9,14.6 9,12.5,10.4,fire,NaN,1

In [274]:
df.head(n=10)

,day,month,year,Temperature,RH,Ws,Rain,FFMC,DMC,DC,ISI,BUI,FWI,Classes,Region
0,01,06,2012,29,57,18,0,65.7,3.4,7.6,1.3,3.4,0.5,not fire,0
1,02,06,2012,29,61,13,1.3,64.4,4.1,7.6,1,3.9,0.4,not fire,0
2,03,06,2012,26,82,22,13.1,47.1,2.5,7.1,0.3,2.7,0.1,not fire,0
3,04,06,2012,25,89,13,2.5,28.6,1.3,6.9,0,1.7,0,not fire,0
4,05,06,2012,27,77,16,0,64.8,3,14.2,1.2,3.9,0.5,not fire,0
5,06,06,2012,31,67,14,0,82.6,5.8,22.2,3.1,7,2.5,fire,0
6,07,06,2012,33,54,13,0,88.2,9.9,30.5,6.4,10.9,7.2,fire,0
7,08,06,2012,30,73,15,0,86.6,12.1,38.3,5.6,13.5,7.1,fire,0
8,09,06,2012,25,88,13,0.2,52.9,7.9,38.8,0.4,10.5,0.3,not fire,0
9,10,06,2012,28,79,12,0,73.2,9.5,46.3,1.3,12.6,0.9,not fire,0

In [275]:
df.columns = df.columns.str.strip()

In [276]:

df['Classes'].value_counts()

Classes
fire             131
not fire         101
fire               4
fire               2
not fire           2
not fire           1
Classes            1
not fire           1
not fire           1
Name: count, dtype: int64

In [277]:
df['Classes'] = df['Classes'].astype(str).str.strip()

In [278]:

df['Classes'].value_counts()

Classes
fire        137
not fire    106
Classes       1
nan           1
Name: count, dtype: int64

In [279]:
df[df['Classes'] == 'Classes']

,day,month,year,Temperature,RH,Ws,Rain,FFMC,DMC,DC,ISI,BUI,FWI,Classes,Region
122,day,month,year,Temperature,RH,Ws,Rain,FFMC,DMC,DC,ISI,BUI,FWI,Classes,1

In [280]:
df.drop(122, inplace=True)

In [281]:
df['Classes'] = df['Classes'].map({'not fire':0,'fire':1})

In [282]:
df['Classes'].value_counts()

Classes
1.0    137
0.0    106
Name: count, dtype: int64

In [283]:
df[df['Classes'].isnull()]

,day,month,year,Temperature,RH,Ws,Rain,FFMC,DMC,DC,ISI,BUI,FWI,Classes,Region
166,14,07,2012,37,37,18,0.2,88.9,12.9,14.6 9,12.5,10.4,fire,NaN,1

In [284]:
data = df['Classes'].dropna().values

In [285]:
# from fitter import Fitter
# f = Fitter(data)
# f.fit()
# f.summary()

In [286]:
f.get_best()

{'weibull_max': {'c': 0.33222838523773623,
  'loc': 1.0000000000000002,
  'scale': 0.6936923747758191}}

In [287]:
df.describe()

          Classes      Region
count  243.000000  244.000000
mean     0.563786    0.500000
std      0.496938    0.501028
min      0.000000    0.000000
25%      0.000000    0.000000
50%      1.000000    0.500000
75%      1.000000    1.000000
max      1.000000    1.000000

In [288]:
df['Classes'].fillna(1.0, inplace=True)

/tmp/ipykernel_892/2529210719.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Classes'].fillna(1.0, inplace=True)

In [289]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 244 entries, 0 to 244
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          244 non-null    object
 1   month        244 non-null    object
 2   year         244 non-null    object
 3   Temperature  244 non-null    object
 4   RH           244 non-null    object
 5   Ws           244 non-null    object
 6   Rain         244 non-null    object
 7   FFMC         244 non-null    object
 8   DMC          244 non-null    object
 9   DC           244 non-null    object
 10  ISI          244 non-null    object
 11  BUI          244 non-null    object
 12  FWI          244 non-null    object
 13  Classes      244 non-null    float64
 14  Region       244 non-null    int64
dtypes: float64(1), int64(1), object(13)
memory usage: 30.5+ KB

In [290]:
df.head(n=10)

,day,month,year,Temperature,RH,Ws,Rain,FFMC,DMC,DC,ISI,BUI,FWI,Classes,Region
0,01,06,2012,29,57,18,0,65.7,3.4,7.6,1.3,3.4,0.5,0.0,0
1,02,06,2012,29,61,13,1.3,64.4,4.1,7.6,1,3.9,0.4,0.0,0
2,03,06,2012,26,82,22,13.1,47.1,2.5,7.1,0.3,2.7,0.1,0.0,0
3,04,06,2012,25,89,13,2.5,28.6,1.3,6.9,0,1.7,0,0.0,0
4,05,06,2012,27,77,16,0,64.8,3,14.2,1.2,3.9,0.5,0.0,0
5,06,06,2012,31,67,14,0,82.6,5.8,22.2,3.1,7,2.5,1.0,0
6,07,06,2012,33,54,13,0,88.2,9.9,30.5,6.4,10.9,7.2,1.0,0
7,08,06,2012,30,73,15,0,86.6,12.1,38.3,5.6,13.5,7.1,1.0,0
8,09,06,2012,25,88,13,0.2,52.9,7.9,38.8,0.4,10.5,0.3,0.0,0
9,10,06,2012,28,79,12,0,73.2,9.5,46.3,1.3,12.6,0.9,0.0,0

In [291]:
df[['day','month','year','Temperature','RH','Ws']] = df[['day','month','year','Temperature','RH','Ws']].astype('int64')

In [292]:
df['Rain'] = df['Rain'].str.strip()

In [293]:
df['Rain'] = df['Rain'].astype('float64')

In [294]:
df['FFMC'] = df['FFMC'].str.strip()
df['FFMC'] = df['FFMC'].astype('float64')

In [295]:
cl = ['DMC','DC','ISI','BUI','FWI']
for col in cl:
    df[col] = df[col].str.strip()
    try:
        df[col] = df[col].astype('float64')
    except Exception as e:
        print(f"Could not convert {col}  to float64")
        print(e)

Could not convert DC  to float64
could not convert string to float: '14.6 9'
Could not convert FWI  to float64
could not convert string to float: 'fire'

In [296]:
df[df['DC'] == '14.6 9']

,day,month,year,Temperature,RH,Ws,Rain,FFMC,DMC,DC,ISI,BUI,FWI,Classes,Region
166,14,7,2012,37,37,18,0.2,88.9,12.9,14.6 9,12.5,10.4,fire,1.0,1

In [297]:
df['DC'] = df['DC'].str.replace(" ","")

In [298]:
df[df['DC'] == '14.6 9']

Empty DataFrame
Columns: [day, month, year, Temperature, RH, Ws, Rain, FFMC, DMC, DC, ISI, BUI, FWI, Classes, Region]
Index: []

In [299]:
df['DC'] = df['DC'].astype('float64')

In [300]:
df[df['FWI']=='fire']

,day,month,year,Temperature,RH,Ws,Rain,FFMC,DMC,DC,ISI,BUI,FWI,Classes,Region
166,14,7,2012,37,37,18,0.2,88.9,12.9,14.69,12.5,10.4,fire,1.0,1

In [302]:
new_df = df['FWI'].drop(166)

In [305]:
new_df = new_df.astype('float64')

In [306]:
new_df.mean()

7.0353909465020585

In [307]:
df['FWI'].replace('fire',new_df.mean(),inplace=True)

In [308]:
df['FWI'] = df['FWI'].astype('float64')

In [309]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 244 entries, 0 to 244
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          244 non-null    int64
 1   month        244 non-null    int64
 2   year         244 non-null    int64
 3   Temperature  244 non-null    int64
 4   RH           244 non-null    int64
 5   Ws           244 non-null    int64
 6   Rain         244 non-null    float64
 7   FFMC         244 non-null    float64
 8   DMC          244 non-null    float64
 9   DC           244 non-null    float64
 10  ISI          244 non-null    float64
 11  BUI          244 non-null    float64
 12  FWI          244 non-null    float64
 13  Classes      244 non-null    float64
 14  Region       244 non-null    int64
dtypes: float64(8), int64(7)
memory usage: 38.6 KB